export const navHeader = [
  { path: "/product-list", title: "رزرو خودرو" },
  { path: "/blog", title: "بلاگ" },
  { path: "/contact-us", title: "تماس با ما" },
];

export const navFooter = [
  {
    title: "دسترسی آسان",
    items: navHeader,
  },
  {
    title: "راه های ارتباطی",
    items: [
      {
        title: "شماره تلفن: +XX XXXX XXXX",
        path: "tel:+XX XXXX XXXX",
      },
      {
        title: "ایمیل: example@domain.com",
        path: "mailto:example@domain.com",
      },
      {
        title: "آدرس",
        label: "ایران، تهران",
        path: "/",
      },
    ],
  },
];

export const capitalAirports = [
  { code: "LHR", city: "لندن", airport: "فرودگاه هیترو" },
  { code: "CDG", city: "پاریس", airport: "فرودگاه شارل دوگل" },
  { code: "BER", city: "برلین", airport: "فرودگاه برلین براندنبورگ" },
  { code: "DCA", city: "واشینگتن دی سی", airport: "فرودگاه ملی رونالد ریگان واشینگتن" },
  { code: "NRT", city: "توکیو", airport: "فرودگاه بین‌المللی ناریتا" },
  { code: "AUH", city: "ابوظبی", airport: "فرودگاه بین‌المللی ابوظبی" },
  { code: "DEL", city: "دهلی نو", airport: "فرودگاه بین‌المللی ایندیرا گاندی" },
  { code: "MAD", city: "مادرید", airport: "فرودگاه آدولفو سوارز مادرید-باراخاس" },
  { code: "FCO", city: "رم", airport: "فرودگاه لئوناردو داوینچی فیومچینو" },
  { code: "PEK", city: "پکن", airport: "فرودگاه بین‌المللی پکن" },
  { code: "MEX", city: "مکزیکو سیتی", airport: "فرودگاه بین‌المللی مکزیکو سیتی" },
  { code: "SIN", city: "سنگاپور", airport: "فرودگاه چانگی" },
  { code: "SYD", city: "کانبرا", airport: "فرودگاه کینگزفورد اسمیت سیدنی" },
  { code: "BKK", city: "بانکوک", airport: "فرودگاه سووارنابومی" },
  { code: "SVO", city: "مسکو", airport: "فرودگاه بین‌المللی شرمتیوو" },
  { code: "JNB", city: "پرتوریا", airport: "فرودگاه اور تامبو" },
  { code: "CAI", city: "قاهره", airport: "فرودگاه بین‌المللی قاهره" },
  { code: "OSL", city: "اسلو", airport: "فرودگاه گاردرموئن اسلو" },
  { code: "VIE", city: "وین", airport: "فرودگاه بین‌المللی وین" },
  { code: "AMS", city: "آمستردام", airport: "فرودگاه اسخیپ هول آمستردام" },
];

export const times = ["00:30", "01:00", "01:30", "02:00", "02:30", "03:00", "03:30", "04:00", "04:30", "05:00", "05:30", "06:00", "06:30", "07:00", "07:30", "08:00", "08:30", "09:00", "09:30", "10:00", "10:30", "11:00", "11:30", "12:00", "12:30", "13:00", "13:30", "14:00", "14:30", "15:00", "15:30", "16:00", "16:30", "17:00", "17:30", "18:00", "18:30", "19:00", "19:30", "20:00", "20:30", "21:00", "21:30", "22:00", "22:30", "23:00", "23:30"];

export const carBrands = ["مرسدس بنز", "بی ام و", "پورشه", "کیا", "هیوندای", "چری", "تویوتا", "لکسوس", "مزدا"];
export const rentOption = ["خودرو با راننده", "خودرو بدون راننده", "خودرو ایرانی", "خودرو لوکس", "خودرو تشریفات", "ماشین عروس"];
