import { useEffect, useState } from "react";
import BaseBg from "../common/BaseBg";
import { useLocation, useNavigate } from "react-router-dom";
import { motion } from "motion/react";
import useMediaQuery from "@/hooks/useMediaQuery";
import { Add } from "iconsax-react";
const Rules = () => {
  const [open, setOpen] = useState(false);
  const location = useLocation();
  const navigate = useNavigate();
  const matches = useMediaQuery("(min-width: 768px)");

  useEffect(() => {
    if (location.pathname === "/payment/2") {
      setOpen(true);
    } else {
      setOpen(false);
    }
  }, [location.pathname]);

  const handleNavigate = (path) => {
    setOpen(false);

    setTimeout(() => {
      navigate(path);
    }, 300);
  };
  return (
    <BaseBg isOpen={open} onClose={null}>
      <motion.div initial={{ y: 1000 }} animate={{ y: 0 }} exit={{ y: 1000 }} transition={{ ease: [0.4, 0, 0.2, 1] }} className={`absolute w-full bottom-0 left-0 ${matches && "Padding"}`}>
        <div className="w-full h-screen md:h-[700px] bg-white flex flex-col px-8 py-4 gap-y-6 md:rounded-t-3xl">
          <div className="flex flex-col gap-y-4">
            <div className="w-full flex justify-between items-center">
              <p className="text-neutral-gray-11 text-xl sm:text-2xl font-semibold">شروط و تعهدات طرفین قرارداد</p>

              <button onClick={() => handleNavigate("/payment/1")} className="bg-neutral-gray-2 rounded-full">
                <Add className="size-7 stroke-neutral-gray-11 rotate-45" />
              </button>
            </div>

            <div className="relative w-full overflow-hidden rounded-full">
              <div className="w-full border-2 border-neutral-gray-2"></div>
              <div className="absolute border-2 border-secondary top-0 right-0 w-10"></div>
            </div>
          </div>

          <div className="w-full flex-1 overflow-auto">
            <p className="leading-loose text-neutral-gray-11 text-sm font-medium">روش ارسال ابلاغیه در این قرارداد، شامل، پیامک یا واتساپ یا ایمیل و یا اظهارنامه به آدرس ثنا یا آدرس مستاجر در این قرارداد مورد توافق طرفین قرار گرفت. مستاجر می بایست مورد اجاره را در همان شرایط و وضعیتی که تحویل گرفته بدون هیچ گونه عیب و نقص و در زمان مقرر مسترد نماید. وجه قرض الحسنه پرداخت شده حداکثر سه روز کاری و پس از اعلام ایستگاه تحویل گیرنده با کسر کسورات احتمالی اعم از جرائم رانندگی خسارات وارده ناشی از آسیب دیدگی، تصادفات، استهلاک خارج از عرف و سایر موارد قابل برداشت می باشد. هر گونه تعویض یا برداشتن قطعات و یا هر نوع خسارتی به خودرو که آن را از حالت اولیه تحویل متغییر کند حتی در حد تعویض یک پیچ یا چراغ راهنمایی و هرگونه دست زدن به ماشین صرفا با اجازه موجر می باشد و در غیر اینصورت مستاجر به موجر حق برداشت مبلغ سپرده را راسا و بدون هر گونه تشریفات داوری و قضایی می دهد و در صورتی که مازاد بر سپرده باشد از طریق داوری و بدون اعتراض باید رسیدگی و اجرا شود. مسئولیت هرگونه تاخیر در استرداد وجوه که به لحاظ عدم ارائه اطلاعات بانکی صحیح توسط مستاجر بوجود آید بر عهده شرکت نمی باشد. استعمال دخانیات در داخل خودرو اکیدا ممنوع می باشد و در صورت عدم رعایت و تایید نماینده بر وجود شواهدی دال بر استعمال دخانیات در خودرو، مستاجر به مبلغ سه میلیون تومان جریمه گردیده که صرف صفرشویی و بو زدایی و خواب خودرو در این مدت خواهد شد و مشتری در لیست سیاه قرار گرفته و شرکت از ادامه و ارائه خدمات به مستاجر معذور می باشد. مستاجر صرفا مجاز به استفاده از خودرو داخل مرزهای کشور ایران و در جاده های آسفالت می باشد ، استفاده از خودرو در خارج از جاده در سامانه رهگیری خودرو ثبت گردیده و هزینه های بازرسی فنی و خسارات فنی از مستاجر اخذ خواهد شد. مستاجر حق واگذاری و یا اجاره مورد اجاره را به غیر، تحت هیچ عنوان جزئا و کلا را نداشته و تمام مسئولیت و عواقب قانونی ناشی از آن به عهده مستاجر می باشد و این عمل مصداق خیانت در امانت تلقی خواهد شد. این رزرو شامل محدودیت پیمایش 1,815 کیلومتر می باشد و برای مسافت بیشتر به ازای هر کیلومتر مبلغ 27,255 تومان دریافت می گردد و در صورت دستکاری کیلومتر خودرو به تشخیص کارشناس شرکت از طریق سامانه ردیابی خودرو، خسارت از مستاجر دریافت خواهد شد. مستاجر می بایست خودرو را با همان میزان سوخت دریافتی مسترد می نماید در غیر این صورت هزینه کسری سوخت به قیمت مصوب روز عودت محاسبه و دریافت می گردد. چنانچه مستاجر در مدت اجاره و انتفاع از خودرو کلیه شرایط مقرر در این قرارداد را رعایت ننموده و از حدود قرارداد تجاوز نماید و یا در نگهداری خودرو مرتکب تعدی یا تفریط گردد و یا در موعد مقرر نسبت به استرداد خودرو اقدام ننموده و یا مال الاجاره را پرداخت ننماید، شرکت حق فسخ یک طرفه قرارداد را دارا می باشد ضمناً استیلای ید امانی مستاجر به حالت ضمانی تبدیل و ضامن میباشد( شرط ضمان بدون تقصیر و تعدی و تفریط و تبدیل ید امان به ید ضمانی) شرکت مستقل از شرط داوری می تواند نسبت به طرح شکایت اقدام نماید. تبصره 1: تعدی و تفریط مستاجر در مورد خسارت به موتور، گیربکس و یا دیگر قطعات خودرو اعم از جزئی و کلی و تغییرات در ارکان اصلی خودرو بعنوان خیانت در امانت تلقی و تشخیص آن اخذ نظریه کارشناسان مورد تایید داور بوده و ملاک طرفین می باشد و هزینه های کارشناسی به عهده مستاجر می باشد. تبصره 2: تشریفات فسخ قید شده از طریق روشهای مورد توافق به مستاجر صورت می گردد و نیاز به طرح دادخواست نداشته و ابلاغ از طرق مورد توافق به مستاجر مندرج در این قرارداد به منزله ابلاغ واقعی محسوب می گردد. مستاجر در زمان انتفاع از خودرو مکلف به رعایت مقررات و قوانین راهنمایی و رانندگی و سایر قوانین جاریه موضوعه و رعایت کلیه شئونات و شعائر اخلاقی می باشد، در این مدت چنانچه مستاجر با استفاده از خودرو مرتکب جرم یا نقض قوانین گردد و در صورت کشف هرگونه فساد در ایام انتفاع خود مستاجر مسئولیت آن را تماماً در مراجع ذیصلاح عهدار بوده و کلیه هزینه های مرتبط با آن اعم از اخذ وکیل، کارشناس و غیره بر عهده مستاجر می باشد. در صورت ضبط یا مصادره خودرو مستاجر ملزم به پرداخت اجاره بهای روزهای توقف و کلیه هزینه های قانونی ناشی از عدم رعایت قوانین توسط مستاجر و پرداخت کل قیمت خودرو به نرخ روز به عنوان خسارت به شرکت می باشد و این موضوع به منزله ادعای عدم قابلیت انتفاع از موضوع اجاره محسوب نمی گردد. هنگام تحویل خودرو مستاجر موظف به بررسی دقیق وضعیت خودرو (خسارات کلی و جزئی- وضعیت سوخت- کیلومتر خودرو و غیره) می باشد، ملاک بررسی و وضعیت خودرو هنگام استرداد فرم امضا شده زمان تحویل بوده و هیچ گونه اعتراضی در مورد آسیب های جزئی یا شکستگی شیشه و غیره پذیرفته نمی شود و مستاجر موظف به جبران خسارات وارده می باشد. هنگام استرداد جهت تسهیل و تشخیص بدنه خودرو، مستاجر ملزم است خودرو را در شرایط مناسب و مطابق وضعیت زمان تحویل به شرکت استرداد نماید و در صورت مهیا نبودن شرایط رویت کامل، وجه سپرده شده پس از حصول اطمینان از عدم وجود خسارت مسترد می گردد و بدیهی است در صورت تمیز نبودن خودرو هزینه های کارواش به عهده مستاجر می باشد. در صورت وقوع هرگونه حادثه یا تصادف به هنگام انتفاع، مستاجر مکلف است ضمن اعلام به پلیس و اخذ گزارش مکتوب پلیس و انجام اقدامات قانونی کلیه جزئیات و مراحل را در اسرع وقت به شرکت اعلام و کسب تکلیف نماید. مستاجر مکلف است که قوانین راهنمایی و رانندگی را رعایت نماید، بدیهی است پرداخت جرائم رانندگی، توقیف خودرو و کلیه مشکلاتی که در زمان استفاده خودرو توسط مستاجر بروز گردد، بعلاوه عین اجاره روزهای خواب خودرو بر عهده مستاجر می باشد. کلیه اقدامات تعمیر و نگهداری و بازدید و سرویس های دوره ای به عهده شرکت بوده و هزینه کلیه تعمیرات و سرویس ها توسط شرکت پرداخت می گردد، لذا مستاجر بدون هماهنگی شرکت حق انجام هیچ گونه تعمیر یا سرویس خودرو را ندارد و در صورت عدم هماهنگی با شرکت هیچگونه وجهی بابت تعمیرات و سرویس های انجام شده پرداخت نخواهد گردید و مستاجر پاسخگوی مشکلات احتمالی بروز مشکلات بابت قطعات و تعمیرات ناصحیح خواهد بود. در صورت عدم دسترسی شرکت به خودرو جهت انجام تعمیرات و سرویس های احتمالی، مستاجر موظف است به محض اعلام شرکت در مدت انتفاع نسبت به انجام تعمیرات و سرویس اقدام نماید در غیر این صورت ضامن پرداخت خسارت های احتمالی عدم سرویس به موقع خواهد بود، در اجاره های بلند مدت ، مستاجر موظف است هر 20 روز با اخذ رسید کتبی از شرکت، خودرو را جهت بررسی سلامت به رویت شرکت برساند. مورد اجاره مجهز به دستگاه ردیاب و حسگر رانندگی می باشد در صورت رانندگی نامناسب اعم از ترمز و پیچش شدید ، شتاب و سرعت غیر مجاز، موارد در سیستم مرکزی ثبت و علاوه بر ابطال امتیاز و با توجه به یکپارچگی سیستم ها مستاجر در لیست سیاه ثبت گردیده و از سایر شرکت های اجاره خودروی دیگر نیز امکان دریافت خدمات نخواهد داشت. خودرو مورد اجاره دارای بیمه شخص ثالث می باشد، مستاجر از پوشش های بیمه شخص ثالث مطابق قوانین بیمه مرکزی ایران برخوردار می باشد، و در صورت استفاده از بیمه در هنگام بروز حادثه، هزینه ی استفاده از بیمه محاسبه و بابت لغو تخفیف های بیمه از مستاجر دریافت می گردد. چنانچه وجه دریافتی از بیمه، خسارت وارده را جبران ننماید، ما به التفاوت از مستاجر دریافت می گردد. تمدید اجاره خودرو الزاما منوط به وجود ظرفیت آزاد در سیستم ناواران می باشد و در صورت عدم وجود ظرفیت مستاجر ملزم به بازگرداندن خودرو در موعد مقرر می باشد. قیمت روزهای تمدید همانند یک رزرو جدید در بازه تمدید خواهد بود.</p>
            <hr className="mt-3" />
            <button onClick={() => handleNavigate("/payment/3")} className="btnBase mb-20 xl:mb-0 btn-fill-primary h-11 mr-auto mt-3">
              پذیرفتن
            </button>
          </div>
        </div>
      </motion.div>
    </BaseBg>
  );
};

export default Rules;
